# 1. Loaded SQLite and Database
- 'CourseData.db'

In [1]:
%reload_ext sql
%sql sqlite:///CourseData.db

'Connected: @CourseData.db'

In [2]:
%%sql
DROP TABLE IF EXISTS CourseData;

 * sqlite:///CourseData.db
Done.

[]

## Drop tables to start from scratch

In [3]:
%%sql
sqlite:///CourseData.db
DROP TABLE IF EXISTS COURSECATALOGS;
DROP TABLE IF EXISTS COURSES;
DROP TABLE IF EXISTS COURSEMEETINGS;

Done.
Done.
Done.

[]

# 2. COUNT 3 .csv Files
- ensured values returned are correct

In [4]:
%%sql
SELECT Count(*) FROM import_course_meetings;

 * sqlite:///CourseData.db
Done.

[(317339,)]

In [5]:
%%sql
SELECT Count(*) FROM import_courses;

 * sqlite:///CourseData.db
Done.

[(15955,)]

In [17]:
%%sql
SELECT Count(*) FROM import_Course_Catalog;

 * sqlite:///CourseData.db
Done.

[(4441,)]

# 3. CREATE Tables

In [18]:
%%sql
DROP TABLE IF EXISTS COURSECATALOGS;

 * sqlite:///CourseData.db
Done.

[]

In [19]:
%%sql
CREATE TABLE COURSECATALOGS (
    CCID INTEGER PRIMARY KEY,
    catalog_id TEXT,
    program_code TEXT,    
    program_name TEXT,
    course_title TEXT,
    prereqs TEXT,    
    coreqs TEXT,
    fees TEXT,
    attributes TEXT,    
    description TEXT
);

 * sqlite:///CourseData.db
Done.

[]

In [20]:
%%sql
DROP TABLE IF EXISTS COURSES;

 * sqlite:///CourseData.db
Done.

[]

In [13]:
%%sql
CREATE TABLE COURSES (
                 primary_instructor, text,
                 term TEXT,
                 crn TEXT,
                 catalog_id TEXT,
                 section TEXT,
                 credits TEXT,
                 title TEXT,
                 meetings TEXT,
                 timecodes TEXT,
                 primary_instructor TEXT,
                 cap TEXT,
                 act TEXT,
                 rem TEXT,
                 CRN-TERM PRIMARY KEY (crn,term)
    );

 * sqlite:///CourseData.db
(sqlite3.OperationalError) table COURSES already exists [SQL: 'CREATE TABLE COURSES (\n                 term TEXT,\n                 crn TEXT,\n                 catalog_id TEXT,\n                 section TEXT,\n                 credits TEXT,\n                 title TEXT,\n                 meetings TEXT,\n                 timecodes TEXT,\n                 primary_instructor TEXT,\n                 cap TEXT,\n                 act TEXT,\n                 rem TEXT,\n                 PRIMARY KEY (crn,term)\n    );'] (Background on this error at: http://sqlalche.me/e/e3q8)

In [10]:
%%sql
CREATE TABLE COURSEMEETINGS (
    CMID INTEGER PRIMARY KEY,
    term TEXT,
    crn TEXT,
    location TEXT NOT NULL,	
    day TEXT NOT NULL,
    start TEXT NOT NULL,
    end TEXT NOT NULL
);

 * sqlite:///CourseData.db
Done.

[]

# 4. Do INSERT Statements

In [11]:
%%sql
DELETE FROM COURSECATALOGS;

INSERT INTO COURSECATALOGS (catalog_id, program_code, program_name, course_title, prereqs, coreqs,fees,attributes,description) 
SELECT DISTINCT catalog_id, program_code, program_name, course_title, prereqs, coreqs, fees, attributes, description
    FROM import_Course_Catalog;

 * sqlite:///CourseData.db
0 rows affected.
2221 rows affected.

[]

In [14]:
%%sql
SELECT * FROM COURSECATALOGS
limit 2;

 * sqlite:///CourseData.db
Done.

[(1, 'AN 0301', 'AN', 'Asian Studies', 'Independent Study', '', '', '', '', 'Students undertake an individualized program of study in consultation with a director from the Asian studies faculty.'),
 (2, 'AN 0310', 'AN', 'Asian Studies', 'Asian Studies Seminar', '', '', '', '', 'This seminar examines selected topics concerning Asia. This course is taught in conjunction with another 100-300 level course from a rotation of cour ... (412 characters truncated) ... e term paper in substitution of some portion of the conjoined course requirements, as determined by the instructor. Open to juniors and seniors only.')]

In [15]:
%%sql 
DELETE FROM COURSEMEETINGS;

INSERT INTO COURSEMEETINGS (term, crn, location, day, start, end)
SELECT DISTINCT term, crn, location, day, start, end
    FROM import_course_meetings
;

 * sqlite:///CourseData.db
0 rows affected.
311142 rows affected.

[]

In [16]:
%%sql
SELECT * FROM COURSEMEETINGS
LIMIT 2;

 * sqlite:///CourseData.db
Done.

[(1, 'Fall2014', '70384', 'DSB 105', 'T', '2014-09-02T08:00:00', '2014-09-02T09:15:00'),
 (2, 'Fall2014', '70384', 'DSB 105', 'F', '2014-09-05T08:00:00', '2014-09-05T09:15:00')]

In [14]:
%%sql
INSERT INTO COURSES (term, crn, catalog_id, section, credits, title, meetings, timecodes, cap, act, rem)
SELECT DISTINCT term, crn, catalog_id, section, credits, title, meetings, timecodes, cap, act, rem
                FROM import_courses

 * sqlite:///CourseData.db
15938 rows affected.

[]

In [15]:
%%sql
SELECT * FROM COURSES
limit 5;

 * sqlite:///CourseData.db
Done.

[('Fall2014', '70384', 'AC 0011', 'C01', '3.000', 'Introduction to Financial Accounting', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", None, '0', '31', '-31'),
 ('Fall2014', '70385', 'AC 0011', 'C02', '3.000', 'Introduction to Financial Accounting', "[{'days': 'TF', 'times': '0930am-1045am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0930am-1045am 09/02-12/08 DSB 105']", None, '0', '31', '-31'),
 ('Fall2014', '70382', 'AC 0011', 'C03', '3.000', 'Introduction to Financial Accounting', "[{'days': 'TF', 'times': '1230pm-0145pm', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 1230pm-0145pm 09/02-12/08 DSB 105']", None, '0', '31', '-31'),
 ('Fall2014', '70291', 'AC 0011', 'C04', '3.000', 'Introduction to Financial Accounting', "[{'days': 'MR', 'times': '1100am-1215pm', 'dates': '09/02-12/08', 'location': 'DSB 111'}]", "['MR 1100am-1215pm 09/02-12/08 DSB 111']", None, '0', '29', '-29'),
 ('Fall2014', '70350', 'AC 0011', 'C05', '3.000', 'Introduction to Financial Accounting', "[{'days': 'MR', 'times': '1230pm-0145pm', 'dates': '09/02-12/08', 'location': 'DSB 111'}]", "['MR 1230pm-0145pm 09/02-12/08 DSB 111']", None, '0', '30', '-30')]

# 5. Run SELECT Queries

In [16]:
%reload_ext sql
%sql sqlite:///CourseData.db

'Connected: @CourseData.db'

## SELECT Query for all unique classrooms 
- only included those with a character lenght of 7 (some had 2, 8, etc.)
- can't figure out how to get a distinct location when including additinonal fields.

In [17]:
%%sql
SELECT DISTINCT 
location
FROM COURSEMEETINGS
WHERE LENGTH(location) = 7
ORDER BY location
LIMIT 2
;

 * sqlite:///CourseData.db
Done.

[('BCC 200',), ('BLM 112',)]

In [18]:
%%sql
SELECT COURSES.catalog_id, COURSEMEETINGS.CMID FROM COURSES
JOIN COURSEMEETINGS ON (COURSEMEETINGS.term=import_courses.term AND COURSEMEETINGS.crn=import_courses.crn)
limit 5;

 * sqlite:///CourseData.db
(sqlite3.OperationalError) no such column: import_courses.term [SQL: 'SELECT COURSES.catalog_id, COURSEMEETINGS.CMID FROM COURSES\nJOIN COURSEMEETINGS ON (COURSEMEETINGS.term=import_courses.term AND COURSEMEETINGS.crn=import_courses.crn)\nlimit 5;'] (Background on this error at: http://sqlalche.me/e/e3q8)

## SELECT Query displaying all courses in MSBA Program '18-'19
- still have to get rid of blank by making defining description as NOT NULL.
- is there an easier way?

In [19]:
%%sql
SELECT course_title AS Course, program_name AS Program, catalog_id AS Code, description AS Description
FROM COURSECATALOGS
WHERE program_name = 'Information Systems'
AND
Code LIKE "IS 05%"
ORDER BY program_name
LIMIT 50;

 * sqlite:///CourseData.db
Done.

[('Information Systems and Database Management', 'Information Systems', 'IS 0500', 'This course introduces the basic concepts and tools relevant to information systems and database management, and their enabling roles in business str ... (334 characters truncated) ... lementation and emerging strategies and technologies such as business intelligence, big data management, web security, and online business analytics.'),
 ('International Information Systems', 'Information Systems', 'IS 0501', 'This course examines information technology environments around the world, and attendant challenges to business strategy and information systems desi ... (161 characters truncated) ... ments, and political-legal systems. The course emphasizes national and regional strategies, emergent technologies, hybrid systems, and equity issues.'),
 ('Python for Business Analytics', 'Information Systems', 'IS 0505', 'In this course, we introduce Python as a language and tool for collecting, preprocessing, and visualizing data for business analytics. since Python i ... (484 characters truncated) ... projects will be used as vehicles to cover the main applications of data analytics, including recommender systems, text analytics, and web analytics.'),
 ('Databases for Business Analytics', 'Information Systems', 'IS 0510', 'This course introduces databases and data management in three parts. The first part covers basic database fundamentals. The second part is a hands-on ... (336 characters truncated) ... edge and skills learned from this class. Advanced topics such as distributed database systems, data services, and NoSQL databases are also discussed.'),
 ('Project Management', 'Information Systems', 'IS 0520', 'This course explores the process and practice of project management. Topics to be covered include project lifecycle and organizations, teambuilding a ... (271 characters truncated) ... s will also be used to provide an active learning environment. This course is designed to count toward professional project management certification.'),
 ('Data Mining and Business Intelligence', 'Information Systems', 'IS 0540', 'This course will change the way you think about data and its role in business. Businesses, governments, and individuals create massive collections of ... (653 characters truncated) ... er application of these techniques is as much an art as it is a science. In addition, we will work "hands-on" with contemporary data mining software.'),
 ('Business Analytics and Big Data Management', 'Information Systems', 'IS 0550', 'This course will survey state-of-the-art topics in Big Data, looking at data collection (via smartphones, sensors, the Web), data storage and process ... (250 characters truncated) ... n, and a range of applications. Each of these five modules will introduce broad concepts as well as provide the most recent developments in the area.'),
 ('Contemporary Topics in Information Systems and Operations Management', 'Information Systems', 'IS 0585', 'This course draws from current literature and practice on information systems and/or operations management. The topics change from semester to semest ... (108 characters truncated) ... ience with spreadsheets, e-procurement, executive information systems, ethics, and other socio-economic factors in the use of information technology.'),
 ('Contemporary Topics: Advanced Data Mining Applications', 'Information Systems', 'IS 0585B', ''),
 ('Independent Study in Information Systems and Operations Management', 'Information Systems', 'IS 0598', 'This course provides an opportunity for students to complete a project or perform research under the direction of an Information Systems and Operatio ... (114 characters truncated) ... mplete a significant project or research paper as the primary requirement of this course. Enrollment by permission of the ISOM Department Chair only.')]

# JOIN Testing

In [20]:
%%sql
SELECT *
FROM COURSES
LIMIT 10;

 * sqlite:///CourseData.db
Done.

[('Fall2014', '70384', 'AC 0011', 'C01', '3.000', 'Introduction to Financial Accounting', "[{'days': 'TF', 'times': '0800am-0915am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0800am-0915am 09/02-12/08 DSB 105']", None, '0', '31', '-31'),
 ('Fall2014', '70385', 'AC 0011', 'C02', '3.000', 'Introduction to Financial Accounting', "[{'days': 'TF', 'times': '0930am-1045am', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0930am-1045am 09/02-12/08 DSB 105']", None, '0', '31', '-31'),
 ('Fall2014', '70382', 'AC 0011', 'C03', '3.000', 'Introduction to Financial Accounting', "[{'days': 'TF', 'times': '1230pm-0145pm', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 1230pm-0145pm 09/02-12/08 DSB 105']", None, '0', '31', '-31'),
 ('Fall2014', '70291', 'AC 0011', 'C04', '3.000', 'Introduction to Financial Accounting', "[{'days': 'MR', 'times': '1100am-1215pm', 'dates': '09/02-12/08', 'location': 'DSB 111'}]", "['MR 1100am-1215pm 09/02-12/08 DSB 111']", None, '0', '29', '-29'),
 ('Fall2014', '70350', 'AC 0011', 'C05', '3.000', 'Introduction to Financial Accounting', "[{'days': 'MR', 'times': '1230pm-0145pm', 'dates': '09/02-12/08', 'location': 'DSB 111'}]", "['MR 1230pm-0145pm 09/02-12/08 DSB 111']", None, '0', '30', '-30'),
 ('Fall2014', '70381', 'AC 0011', 'C06', '3.000', 'Introduction to Financial Accounting', "[{'days': 'MR', 'times': '0330pm-0445pm', 'dates': '09/02-12/08', 'location': 'DSB 110A'}]", "['MR 0330pm-0445pm 09/02-12/08 DSB 110A']", None, '0', '31', '-31'),
 ('Fall2014', '70383', 'AC 0011', 'G', '3.000', 'Introduction to Financial Accounting', "[{'days': 'MR', 'times': '0930am-1045am', 'dates': '09/02-12/08', 'location': 'DSB 111'}]", "['MR 0930am-1045am 09/02-12/08 DSB 111']", None, '30', '31', '-1'),
 ('Fall2014', '70391', 'AC 0011', 'H', '3.000', 'Introduction to Financial Accounting', "[{'days': 'TF', 'times': '0930am-1045am', 'dates': '09/02-12/08', 'location': 'DSB 110A'}]", "['TF 0930am-1045am 09/02-12/08 DSB 110A']", None, '30', '32', '-2'),
 ('Fall2014', '71105', 'AC 0011', 'I', '3.000', 'Introduction to Financial Accounting', "[{'days': 'TF', 'times': '1100am-1215pm', 'dates': '09/02-12/08', 'location': 'DSB 110A'}]", "['TF 1100am-1215pm 09/02-12/08 DSB 110A']", None, '30', '33', '-3'),
 ('Fall2014', '71123', 'AC 0011', 'J', '3.000', 'Introduction to Financial Accounting', "[{'days': 'TF', 'times': '0200pm-0315pm', 'dates': '09/02-12/08', 'location': 'DSB 105'}]", "['TF 0200pm-0315pm 09/02-12/08 DSB 105']", None, '30', '32', '-2')]

In [21]:
%%sql
SELECT t.primary_instructor, c.catalog_id
FROM COURSES as c
JOIN TEACHERS as t ON c.TID = t.TI;

 * sqlite:///CourseData.db
(sqlite3.OperationalError) no such column: c.TID [SQL: 'SELECT t.primary_instructor, c.catalog_id\nFROM COURSES as c\nJOIN TEACHERS as t ON c.TID = t.TI;'] (Background on this error at: http://sqlalche.me/e/e3q8)

In [22]:
%%sql
SELECT TID, primary_instructor FROM TEACHERS
limit 10;

 * sqlite:///CourseData.db
Done.

[]

Have to finish insterting COURSES column

In [23]:
%%sql
VACUUM;

 * sqlite:///CourseData.db
Done.

[]